CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_rcu.h
/* RCU_PLLCFG */
#define RCU_PLLCFG_PLLI2SDIV            BITS(0,5)                 /*!< PLLI2S clock divider factor */
#define RCU_PLLCFG_PLLI2SN              BITS(8,14)                /*!< the PLLI2S VCO clock multiplication factor */
#define RCU_PLLCFG_PLLI2SPSC            BITS(16,18)               /*!< the PLLI2S VCO source clock pre-scale */
#define RCU_PLLCFG_PLLDIGOSEL           BITS(24,25)               /*!< PLLDIG output frequency select */
#define RCU_PLLCFG_PLLDIGFSYSDIV        BITS(26,31)               /*!< PLLDIG clock divider factor for system clock */

/* RCU_CFG1 */
#define RCU_CFG1_IRC16MDIV              BITS(0,8)                 /*!< IRC16M clock divider factor for system clock */
#define RCU_CFG1_BGVBIT                 BITS(9,11)                /*!< bandGap Power adjust */
#define RCU_CFG1_RFPLLCALEN             BIT(14)                   /*!< RF PLL Calculation enable */
#define RCU_CFG1_RFPLLLOCK              BIT(15)                   /*!< RF PLL LOCK */
#define RCU_CFG1_RFPLLPU                BIT(16)                   /*!< RFPLL power on enable */
#define RCU_CFG1_LDOANAPU               BIT(17)                   /*!< LDO analog power on enable for RF filter */
#define RCU_CFG1_LDOCLKPU               BIT(18)                   /*!< LDO clock power on enable for RF/ADC/DAC */
#define RCU_CFG1_BGPU                   BIT(19)                   /*!< bandGap power on enable */
#define RCU_CFG1_LDO_CLK_LQB            BIT(20)                   /*!< trust zone security by RF */
#define RCU_CFG1_LDO_ANA_LQB            BIT(21)                   /*!< trust zone security by RF */
#define RCU_CFG1_TIMERSEL               BIT(24)                   /*!< TIMER clock selection */
#define RCU_CFG1_I2C0SEL                BITS(26,27)               /*!< I2C0 Clock Source Selection */
#define RCU_CFG1_USART2SEL              BITS(28,29)               /*!< USART2 Clock Source Selection */
#define RCU_CFG1_USART0SEL              BITS(30,31)               /*!< USART0 Clock Source Selection */

/* RCU_ADDCTL */
#define RCU_ADDCTL_USBFSSEL             BIT(0)                    /*!< USBFS clock selection */
#define RCU_ADDCTL_USBFSDIV             BITS(1,5)                 /*!< USBFS clock divider factor */
#if (defined(GD32W515PI) || defined(GD32W515P0))
#define RCU_ADDCTL_HPDFSEL              BIT(11)                   /*!< HPDF clock source selection */
#endif /* GD32W515PI and GD32W515P0 */
#define RCU_ADDCTL_I2SSEL               BITS(12,13)               /*!< I2S clock source selection */
#if (defined(GD32W515PI) || defined(GD32W515P0))
#define RCU_ADDCTL_HPDFAUDIOSEL         BITS(14,15)               /*!< HPDF AUDIO clock source selection */
#endif /* GD32W515PI and GD32W515P0 */
#define RCU_ADDCTL_SDIOSEL_0            BIT(16)                   /*!< SDIO clock selection */
#define RCU_ADDCTL_SDIODIV              BITS(17,21)               /*!< SDIO clock divider factor */
#define RCU_ADDCTL_SDIOSEL_1            BIT(22)                   /*!< SDIO clock selection */
#define RCU_ADDCTL_PLLFI2SDIV           BITS(24,29)               /*!< the PLL divider factor for I2S clock */

/* RCU_SECP_CFG */
#define RCU_SECP_CFG_IRC16MSECP            BIT(0)                 /*!< IRC16M clock configuration and status bits security */
#define RCU_SECP_CFG_HXTALSECP             BIT(1)                 /*!< HXTAL clock configuration and status bits security */
#define RCU_SECP_CFG_IRC32KSECP            BIT(2)                 /*!< IRC32K clock configuration and status bits security */
#define RCU_SECP_CFG_LXTALSECP             BIT(3)                 /*!< LXTAL clock configuration and status bits security */
#define RCU_SECP_CFG_SYSCLKSECP            BIT(4)                 /*!< SYSCLK clock selection, STOPWUCK bit, clock output on MCO configuration */
#define RCU_SECP_CFG_PRESCSECP             BIT(5)                 /*!< AHBx/APBx prescaler configuration bits security */
#define RCU_SECP_CFG_PLLSECP               BIT(6)                 /*!< main PLL configuration and status bits security */
#define RCU_SECP_CFG_PLLDIGSECP            BIT(7)                 /*!< PLLDIG configuration and status bits security */
#define RCU_SECP_CFG_PLLI2SSECP            BIT(8)                 /*!< PLLI2S configuration and status bits security */
#define RCU_SECP_CFG_RMVRSTFSECP           BIT(9)                 /*!< remove reset flag security */
#define RCU_SECP_CFG_BKPSECP               BIT(10)                /*!< BKP security */

/* RCU_SECP_STAT */
#define RCU_SECP_STAT_IRC16MSECF          BIT(0)                  /*!< IRC16M clock configuration and status bits security flag */
#define RCU_SECP_STAT_HXTALSECF           BIT(1)                  /*!< HXTAL clock configuration and status bits security flag */
#define RCU_SECP_STAT_IRC32KSECF          BIT(2)                  /*!< IRC32K clock configuration and status bits security flag */
#define RCU_SECP_STAT_LXTALSECF           BIT(3)                  /*!< LXTAL clock configuration and status bits security flag */
#define RCU_SECP_STAT_SYSCLKSECF          BIT(4)                  /*!< SYSCLK clock selection, STOPWUCK bit, clock output on MCO configuration */
#define RCU_SECP_STAT_PRESCSECF           BIT(5)                  /*!< AHBx/APBx prescaler configuration bits security flag */
#define RCU_SECP_STAT_PLLSECF             BIT(6)                  /*!< main PLL configuration and status bits security flag */
#define RCU_SECP_STAT_PLLDIGSECF          BIT(7)                  /*!< PLLDIG configuration and status bits security flag */
#define RCU_SECP_STAT_PLLI2SSECF          BIT(8)                  /*!< PLLI2S configuration and status bits security flag */
#define RCU_SECP_STAT_RMVRSTFSECF         BIT(9)                  /*!< remove reset flag security flag */
#define RCU_SECP_STAT_BKPSECF             BIT(10)                 /*!< BKP security flag */

/* RCU_AHB1SECP_STAT */
#define RCU_AHB1SECP_STAT_PASECF          BIT(0)                  /*!< GPIO port A security flag */
#define RCU_AHB1SECP_STAT_PBSECF          BIT(1)                  /*!< GPIO port B security flag */
#define RCU_AHB1SECP_STAT_PCSECF          BIT(2)                  /*!< GPIO port C security flag */
#define RCU_AHB1SECP_STAT_CRCSECF         BIT(12)                 /*!< CRC security flag */
#define RCU_AHB1SECP_STAT_WIFISECF        BIT(13)                 /*!< WIFI security flag */
#define RCU_AHB1SECP_STAT_FLITFSECF       BIT(15)                 /*!< FLITF security flag */
#define RCU_AHB1SECP_STAT_SRAM0SECF       BIT(16)                 /*!< SRAM0 security flag */
#define RCU_AHB1SECP_STAT_SRAM1SECF       BIT(17)                 /*!< SRAM1 security flag */
#define RCU_AHB1SECP_STAT_SRAM2SECF       BIT(18)                 /*!< SRAM2 security flag */
#define RCU_AHB1SECP_STAT_SRAM3SECF       BIT(19)                 /*!< SRAM3 security flag */
#define RCU_AHB1SECP_STAT_DMA0SECF        BIT(21)                 /*!< DMA0 security flag */
#define RCU_AHB1SECP_STAT_DMA1SECF        BIT(22)                 /*!< DMA1 security flag */
#define RCU_AHB1SECP_STAT_USBFSSECF       BIT(29)                 /*!< USBFS security flag */

/* RCU_AHB2SECP_STAT */
#if (defined(GD32W515PI) || defined(GD32W515P0))
#define RCU_AHB2SECP_STAT_DCISECF         BIT(0)                  /*!< DCI security flag */
#endif /* GD32W515PI and GD32W515P0 */
#define RCU_AHB2SECP_STAT_PKCAUSECF       BIT(3)                  /*!< PKCAU security flag */
#define RCU_AHB2SECP_STAT_CAUSECF         BIT(4)                  /*!< CAU security flag */
#define RCU_AHB2SECP_STAT_HAUSECF         BIT(5)                  /*!< HAU security flag */
#define RCU_AHB2SECP_STAT_TRNGSECF        BIT(6)                  /*!< TRNG security flag */

/* RCU_AHB3SECP_STAT */
#define RCU_AHB3SECP_STAT_SQPISECF        BIT(0)                  /*!< SQPI security flag */
#define RCU_AHB3SECP_STAT_QSPISECF        BIT(1)                  /*!< QSPI security flag */

/* RCU_APB1SECP_STAT */
#define RCU_APB1SECP_STAT_TIMER1SECF      BIT(0)                  /*!< TIMER1 security flag */
#define RCU_APB1SECP_STAT_TIMER2SECF      BIT(1)                  /*!< TIMER2 security flag */
#if (defined(GD32W515PI) || defined(GD32W515P0))
#define RCU_APB1SECP_STAT_TIMER3SECF      BIT(2)                  /*!< TIMER3 security flag */
#endif /* GD32W515PI and GD32W515P0 */
#define RCU_APB1SECP_STAT_TIMER4SECF      BIT(3)                  /*!< TIMER4 security flag */
#define RCU_APB1SECP_STAT_TIMER5SECF      BIT(4)                  /*!< TIMER5 security flag */
#define RCU_APB1SECP_STAT_WWDGTSECF       BIT(11)                 /*!< WWDGT security flag */
#define RCU_APB1SECP_STAT_SPI1SECF        BIT(14)                 /*!< SPI1 security flag */
#define RCU_APB1SECP_STAT_USART1SECF      BIT(17)                 /*!< USART1 security flag */
#define RCU_APB1SECP_STAT_USART2SECF      BIT(18)                 /*!< USART2 security flag */
#define RCU_APB1SECP_STAT_I2C0SECF        BIT(21)                 /*!< I2C0 security flag */
#define RCU_APB1SECP_STAT_I2C1SECF        BIT(22)                 /*!< I2C1 security flag */
#define RCU_APB1SECP_STAT_PMUSECF         BIT(28)                 /*!< PMU security flag */

/* RCU_APB2SECP_STAT */
#define RCU_APB2SECP_STAT_TIMER0SECF      BIT(0)                  /*!< TIMER0 security flag */
#define RCU_APB2SECP_STAT_USART0SECF      BIT(4)                  /*!< USART0 security flag */
#define RCU_APB2SECP_STAT_ADCSECF         BIT(8)                  /*!< ADC security flag */
#define RCU_APB2SECP_STAT_SDIOSECF        BIT(11)                 /*!< SDIO security flag */
#define RCU_APB2SECP_STAT_SPI0SECF        BIT(12)                 /*!< SPI0 security flag */
#define RCU_APB2SECP_STAT_SYSCFGSECF      BIT(14)                 /*!< SYSCFG security flag */
#define RCU_APB2SECP_STAT_TIMER15SECF     BIT(17)                 /*!< TIMER15 security flag */
#define RCU_APB2SECP_STAT_TIMER16SECF     BIT(18)                 /*!< TIMER16 security flag */
#if (defined(GD32W515PI) || defined(GD32W515P0))
#define RCU_APB2SECP_STAT_HPDFSECF        BIT(30)                 /*!< HPDF security flag */
#endif /* GD32W515PI and GD32W515P0 */
#define RCU_APB2SECP_STAT_RFSECF          BIT(31)                 /*!< RF security flag */

/* RCU_VKEY */
#define RCU_VKEY_KEY                    BITS(0,31)                /*!< RCU_DSV key register */

/* RCU_DSV */
#define RCU_DSV_DSLPVS                  BITS(0,1)                 /*!< deep-sleep mode voltage select */

/* constants definitions */
/* define the peripheral clock enable bit position and its register index offset */
#define RCU_REGIDX_BIT(regidx, bitpos)      (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define RCU_REG_VAL(periph)                 (REG32(RCU + ((uint32_t)(periph) >> 6U)))
#define RCU_BIT_POS(val)                    ((uint32_t)(val) & 0x1FU)
/* define the voltage key unlock value */
#define RCU_VKEY_UNLOCK                     ((uint32_t)0x1A2B3C4DU)

/* register offset */
/* peripherals enable */
#define AHB1EN_REG_OFFSET               0x30U                     /*!< AHB1 enable register offset */
#define AHB2EN_REG_OFFSET               0x34U                     /*!< AHB2 enable register offset */
#define AHB3EN_REG_OFFSET               0x38U                     /*!< AHB3 enable register offset */
#define APB1EN_REG_OFFSET               0x40U                     /*!< APB1 enable register offset */
#define APB2EN_REG_OFFSET               0x44U                     /*!< APB2 enable register offset */
#define AHB1SPEN_REG_OFFSET             0x50U                     /*!< AHB1 sleep mode enable register offset */
#define AHB2SPEN_REG_OFFSET             0x54U                     /*!< AHB2 sleep mode enable register offset */
#define AHB3SPEN_REG_OFFSET             0x58U                     /*!< AHB3 sleep mode enable register offset */
#define APB1SPEN_REG_OFFSET             0x60U                     /*!< APB1 sleep mode enable register offset */
#define APB2SPEN_REG_OFFSET             0x64U                     /*!< APB2 sleep mode enable register offset */

