CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_rcu.h
/* SDIO Clock source selection */
#define RCU_SDIOSRC_MASK                 0X00410000U    
#define RCU_SDIOSRC_PLL                  0X00000000U                                  /*!< select PLL clock */
#define RCU_SDIOSRC_PLLDIG               RCU_ADDCTL_SDIOSEL_0                         /*!< select PLLDIG clock */
#define RCU_SDIOSRC_IRC16M               RCU_ADDCTL_SDIOSEL_1                         /*!< select IRC16M */
#define RCU_SDIOSRC_HXTAL                RCU_ADDCTL_SDIOSEL_0 | RCU_ADDCTL_SDIOSEL_1  /*!< select HXTAL */

/* SDIODIV division factor */
#define ADDCTL_SDIODIV(regval)            (BITS(17,21) & ((uint32_t)(regval) << 17U))
#define RCU_SDIODIV_DIV1                  ADDCTL_SDIODIV(0)                         /*!< SDIODIV input source clock divided by 1 */
#define RCU_SDIODIV_DIV2                  ADDCTL_SDIODIV(1)                         /*!< SDIODIV input source clock divided by 2 */
#define RCU_SDIODIV_DIV3                  ADDCTL_SDIODIV(2)                         /*!< SDIODIV input source clock divided by 3 */
#define RCU_SDIODIV_DIV4                  ADDCTL_SDIODIV(3)                         /*!< SDIODIV input source clock divided by 4 */
#define RCU_SDIODIV_DIV5                  ADDCTL_SDIODIV(4)                         /*!< SDIODIV input source clock divided by 5 */
#define RCU_SDIODIV_DIV6                  ADDCTL_SDIODIV(5)                         /*!< SDIODIV input source clock divided by 6 */
#define RCU_SDIODIV_DIV7                  ADDCTL_SDIODIV(6)                         /*!< SDIODIV input source clock divided by 7 */
#define RCU_SDIODIV_DIV8                  ADDCTL_SDIODIV(7)                         /*!< SDIODIV input source clock divided by 8 */
#define RCU_SDIODIV_DIV9                  ADDCTL_SDIODIV(8)                         /*!< SDIODIV input source clock divided by 9 */
#define RCU_SDIODIV_DIV10                 ADDCTL_SDIODIV(9)                         /*!< SDIODIV input source clock divided by 10 */
#define RCU_SDIODIV_DIV11                 ADDCTL_SDIODIV(10)                        /*!< SDIODIV input source clock divided by 11 */
#define RCU_SDIODIV_DIV12                 ADDCTL_SDIODIV(11)                        /*!< SDIODIV input source clock divided by 12 */
#define RCU_SDIODIV_DIV13                 ADDCTL_SDIODIV(12)                        /*!< SDIODIV input source clock divided by 13 */
#define RCU_SDIODIV_DIV14                 ADDCTL_SDIODIV(13)                        /*!< SDIODIV input source clock divided by 14 */
#define RCU_SDIODIV_DIV15                 ADDCTL_SDIODIV(14)                        /*!< SDIODIV input source clock divided by 15 */
#define RCU_SDIODIV_DIV16                 ADDCTL_SDIODIV(15)                        /*!< SDIODIV input source clock divided by 16 */
#define RCU_SDIODIV_DIV17                 ADDCTL_SDIODIV(16)                        /*!< SDIODIV input source clock divided by 17 */
#define RCU_SDIODIV_DIV18                 ADDCTL_SDIODIV(17)                        /*!< SDIODIV input source clock divided by 18 */
#define RCU_SDIODIV_DIV19                 ADDCTL_SDIODIV(18)                        /*!< SDIODIV input source clock divided by 19 */
#define RCU_SDIODIV_DIV20                 ADDCTL_SDIODIV(19)                        /*!< SDIODIV input source clock divided by 20 */
#define RCU_SDIODIV_DIV21                 ADDCTL_SDIODIV(20)                        /*!< SDIODIV input source clock divided by 21 */
#define RCU_SDIODIV_DIV22                 ADDCTL_SDIODIV(21)                        /*!< SDIODIV input source clock divided by 22 */
#define RCU_SDIODIV_DIV23                 ADDCTL_SDIODIV(22)                        /*!< SDIODIV input source clock divided by 23 */
#define RCU_SDIODIV_DIV24                 ADDCTL_SDIODIV(23)                        /*!< SDIODIV input source clock divided by 24 */
#define RCU_SDIODIV_DIV25                 ADDCTL_SDIODIV(24)                        /*!< SDIODIV input source clock divided by 25 */
#define RCU_SDIODIV_DIV26                 ADDCTL_SDIODIV(25)                        /*!< SDIODIV input source clock divided by 26 */
#define RCU_SDIODIV_DIV27                 ADDCTL_SDIODIV(26)                        /*!< SDIODIV input source clock divided by 27 */
#define RCU_SDIODIV_DIV28                 ADDCTL_SDIODIV(27)                        /*!< SDIODIV input source clock divided by 28 */
#define RCU_SDIODIV_DIV29                 ADDCTL_SDIODIV(28)                        /*!< SDIODIV input source clock divided by 29 */
#define RCU_SDIODIV_DIV30                 ADDCTL_SDIODIV(29)                        /*!< SDIODIV input source clock divided by 30 */
#define RCU_SDIODIV_DIV31                 ADDCTL_SDIODIV(30)                        /*!< SDIODIV input source clock divided by 31 */
#define RCU_SDIODIV_DIV32                 ADDCTL_SDIODIV(31)                        /*!< SDIODIV input source clock divided by 32 */

/* RCU_ADDCTL register bit define */
/* PLLFI2SDIV division factor */
#define ADDCTL_PLLFI2SDIV(regval)         (BITS(24,29) & ((uint32_t)(regval) << 24U))
#define RCU_PLLFI2SDIV_DIV1                ADDCTL_PLLFI2SDIV(0)                     /*!< PLL clock divided by 1 for I2S clock */
#define RCU_PLLFI2SDIV_DIV2                ADDCTL_PLLFI2SDIV(1)                     /*!< PLL clock divided by 2 for I2S clock */
#define RCU_PLLFI2SDIV_DIV3                ADDCTL_PLLFI2SDIV(2)                     /*!< PLL clock divided by 3 for I2S clock */
#define RCU_PLLFI2SDIV_DIV4                ADDCTL_PLLFI2SDIV(3)                     /*!< PLL clock divided by 4 for I2S clock */
#define RCU_PLLFI2SDIV_DIV5                ADDCTL_PLLFI2SDIV(4)                     /*!< PLL clock divided by 5 for I2S clock */
#define RCU_PLLFI2SDIV_DIV6                ADDCTL_PLLFI2SDIV(5)                     /*!< PLL clock divided by 6 for I2S clock */
#define RCU_PLLFI2SDIV_DIV7                ADDCTL_PLLFI2SDIV(6)                     /*!< PLL clock divided by 7 for I2S clock */
#define RCU_PLLFI2SDIV_DIV8                ADDCTL_PLLFI2SDIV(7)                     /*!< PLL clock divided by 8 for I2S clock */
#define RCU_PLLFI2SDIV_DIV9                ADDCTL_PLLFI2SDIV(8)                     /*!< PLL clock divided by 9 for I2S clock */
#define RCU_PLLFI2SDIV_DIV10               ADDCTL_PLLFI2SDIV(9)                     /*!< PLL clock divided by 10 for I2S clock */
#define RCU_PLLFI2SDIV_DIV11               ADDCTL_PLLFI2SDIV(10)                    /*!< PLL clock divided by 11 for I2S clock */
#define RCU_PLLFI2SDIV_DIV12               ADDCTL_PLLFI2SDIV(11)                    /*!< PLL clock divided by 12 for I2S clock */
#define RCU_PLLFI2SDIV_DIV13               ADDCTL_PLLFI2SDIV(12)                    /*!< PLL clock divided by 13 for I2S clock */
#define RCU_PLLFI2SDIV_DIV14               ADDCTL_PLLFI2SDIV(13)                    /*!< PLL clock divided by 14 for I2S clock */
#define RCU_PLLFI2SDIV_DIV15               ADDCTL_PLLFI2SDIV(14)                    /*!< PLL clock divided by 15 for I2S clock */
#define RCU_PLLFI2SDIV_DIV16               ADDCTL_PLLFI2SDIV(15)                    /*!< PLL clock divided by 16 for I2S clock */
#define RCU_PLLFI2SDIV_DIV17               ADDCTL_PLLFI2SDIV(16)                    /*!< PLL clock divided by 17 for I2S clock */
#define RCU_PLLFI2SDIV_DIV18               ADDCTL_PLLFI2SDIV(17)                    /*!< PLL clock divided by 18 for I2S clock */
#define RCU_PLLFI2SDIV_DIV19               ADDCTL_PLLFI2SDIV(18)                    /*!< PLL clock divided by 19 for I2S clock */
#define RCU_PLLFI2SDIV_DIV20               ADDCTL_PLLFI2SDIV(19)                    /*!< PLL clock divided by 20 for I2S clock */
#define RCU_PLLFI2SDIV_DIV21               ADDCTL_PLLFI2SDIV(20)                    /*!< PLL clock divided by 21 for I2S clock */
#define RCU_PLLFI2SDIV_DIV22               ADDCTL_PLLFI2SDIV(21)                    /*!< PLL clock divided by 22 for I2S clock */
#define RCU_PLLFI2SDIV_DIV23               ADDCTL_PLLFI2SDIV(22)                    /*!< PLL clock divided by 23 for I2S clock */
#define RCU_PLLFI2SDIV_DIV24               ADDCTL_PLLFI2SDIV(23)                    /*!< PLL clock divided by 24 for I2S clock */
#define RCU_PLLFI2SDIV_DIV25               ADDCTL_PLLFI2SDIV(24)                    /*!< PLL clock divided by 25 for I2S clock */
#define RCU_PLLFI2SDIV_DIV26               ADDCTL_PLLFI2SDIV(25)                    /*!< PLL clock divided by 26 for I2S clock */
#define RCU_PLLFI2SDIV_DIV27               ADDCTL_PLLFI2SDIV(26)                    /*!< PLL clock divided by 27 for I2S clock */
#define RCU_PLLFI2SDIV_DIV28               ADDCTL_PLLFI2SDIV(27)                    /*!< PLL clock divided by 28 for I2S clock */
#define RCU_PLLFI2SDIV_DIV29               ADDCTL_PLLFI2SDIV(28)                    /*!< PLL clock divided by 29 for I2S clock */
#define RCU_PLLFI2SDIV_DIV30               ADDCTL_PLLFI2SDIV(29)                    /*!< PLL clock divided by 30 for I2S clock */
#define RCU_PLLFI2SDIV_DIV31               ADDCTL_PLLFI2SDIV(30)                    /*!< PLL clock divided by 31 for I2S clock */
#define RCU_PLLFI2SDIV_DIV32               ADDCTL_PLLFI2SDIV(31)                    /*!< PLL clock divided by 32 for I2S clock */
#define RCU_PLLFI2SDIV_DIV33               ADDCTL_PLLFI2SDIV(32)                    /*!< PLL clock divided by 33 for I2S clock */
#define RCU_PLLFI2SDIV_DIV34               ADDCTL_PLLFI2SDIV(33)                    /*!< PLL clock divided by 34 for I2S clock */
#define RCU_PLLFI2SDIV_DIV35               ADDCTL_PLLFI2SDIV(34)                    /*!< PLL clock divided by 35 for I2S clock */
#define RCU_PLLFI2SDIV_DIV36               ADDCTL_PLLFI2SDIV(35)                    /*!< PLL clock divided by 36 for I2S clock */
#define RCU_PLLFI2SDIV_DIV37               ADDCTL_PLLFI2SDIV(36)                    /*!< PLL clock divided by 37 for I2S clock */
#define RCU_PLLFI2SDIV_DIV38               ADDCTL_PLLFI2SDIV(37)                    /*!< PLL clock divided by 38 for I2S clock */
#define RCU_PLLFI2SDIV_DIV39               ADDCTL_PLLFI2SDIV(38)                    /*!< PLL clock divided by 39 for I2S clock */
#define RCU_PLLFI2SDIV_DIV40               ADDCTL_PLLFI2SDIV(39)                    /*!< PLL clock divided by 40 for I2S clock */
#define RCU_PLLFI2SDIV_DIV41               ADDCTL_PLLFI2SDIV(40)                    /*!< PLL clock divided by 41 for I2S clock */
#define RCU_PLLFI2SDIV_DIV42               ADDCTL_PLLFI2SDIV(41)                    /*!< PLL clock divided by 42 for I2S clock */
#define RCU_PLLFI2SDIV_DIV43               ADDCTL_PLLFI2SDIV(42)                    /*!< PLL clock divided by 43 for I2S clock */
#define RCU_PLLFI2SDIV_DIV44               ADDCTL_PLLFI2SDIV(43)                    /*!< PLL clock divided by 44 for I2S clock */
#define RCU_PLLFI2SDIV_DIV45               ADDCTL_PLLFI2SDIV(44)                    /*!< PLL clock divided by 45 for I2S clock */
#define RCU_PLLFI2SDIV_DIV46               ADDCTL_PLLFI2SDIV(45)                    /*!< PLL clock divided by 46 for I2S clock */
#define RCU_PLLFI2SDIV_DIV47               ADDCTL_PLLFI2SDIV(46)                    /*!< PLL clock divided by 47 for I2S clock */
#define RCU_PLLFI2SDIV_DIV48               ADDCTL_PLLFI2SDIV(47)                    /*!< PLL clock divided by 48 for I2S clock */
#define RCU_PLLFI2SDIV_DIV49               ADDCTL_PLLFI2SDIV(48)                    /*!< PLL clock divided by 49 for I2S clock */
#define RCU_PLLFI2SDIV_DIV50               ADDCTL_PLLFI2SDIV(49)                    /*!< PLL clock divided by 50 for I2S clock */
#define RCU_PLLFI2SDIV_DIV51               ADDCTL_PLLFI2SDIV(50)                    /*!< PLL clock divided by 51 for I2S clock */
#define RCU_PLLFI2SDIV_DIV52               ADDCTL_PLLFI2SDIV(51)                    /*!< PLL clock divided by 52 for I2S clock */
#define RCU_PLLFI2SDIV_DIV53               ADDCTL_PLLFI2SDIV(52)                    /*!< PLL clock divided by 53 for I2S clock */
#define RCU_PLLFI2SDIV_DIV54               ADDCTL_PLLFI2SDIV(53)                    /*!< PLL clock divided by 54 for I2S clock */
#define RCU_PLLFI2SDIV_DIV55               ADDCTL_PLLFI2SDIV(54)                    /*!< PLL clock divided by 55 for I2S clock */
#define RCU_PLLFI2SDIV_DIV56               ADDCTL_PLLFI2SDIV(55)                    /*!< PLL clock divided by 56 for I2S clock */
#define RCU_PLLFI2SDIV_DIV57               ADDCTL_PLLFI2SDIV(56)                    /*!< PLL clock divided by 57 for I2S clock */
#define RCU_PLLFI2SDIV_DIV58               ADDCTL_PLLFI2SDIV(57)                    /*!< PLL clock divided by 58 for I2S clock */
#define RCU_PLLFI2SDIV_DIV59               ADDCTL_PLLFI2SDIV(58)                    /*!< PLL clock divided by 59 for I2S clock */
#define RCU_PLLFI2SDIV_DIV60               ADDCTL_PLLFI2SDIV(59)                    /*!< PLL clock divided by 60 for I2S clock */
#define RCU_PLLFI2SDIV_DIV61               ADDCTL_PLLFI2SDIV(60)                    /*!< PLL clock divided by 61 for I2S clock */
#define RCU_PLLFI2SDIV_DIV62               ADDCTL_PLLFI2SDIV(61)                    /*!< PLL clock divided by 62 for I2S clock */
#define RCU_PLLFI2SDIV_DIV63               ADDCTL_PLLFI2SDIV(62)                    /*!< PLL clock divided by 63 for I2S clock */
#define RCU_PLLFI2SDIV_DIV64               ADDCTL_PLLFI2SDIV(63)                    /*!< PLL clock divided by 64 for I2S clock */

/* TIMER clock selection */
#define RCU_TIMER_PSC_MUL2              ~RCU_CFG1_TIMERSEL                 /*!< if APB1PSC/APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB) 
                                                                                or 0b100(CK_APBx = CK_AHB/2), the TIMER clock is equal to CK_AHB(CK_TIMERx = CK_AHB).
                                                                                or else, the TIMER clock is twice the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 2 x CK_APB1; 
                                                                                TIMER in APB2 domain: CK_TIMERx = 2 x CK_APB2) */
#define RCU_TIMER_PSC_MUL4              RCU_CFG1_TIMERSEL                  /*!< if APB1PSC/APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB), 
                                                                                0b100(CK_APBx = CK_AHB/2), or 0b101(CK_APBx = CK_AHB/4), the TIMER clock is equal to CK_AHB(CK_TIMERx = CK_AHB). 
                                                                                or else, the TIMER clock is four timers the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 4 x CK_APB1;  
                                                                                TIMER in APB2 domain: CK_TIMERx = 4 x CK_APB2) */

