CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_rcu.h
/* RCU_PLLSSCTL register bit define */
/* PLL spread spectrum modulation type select */
#define RCU_SS_TYPE_CENTER              ((uint32_t)0x00000000U)            /*!< center type is selected */
#define RCU_SS_TYPE_DOWN                RCU_PLLSSCTL_SS_TYPE               /*!< down type is selected */

/* RCU_PLL register bit define */
/* The PLL VCO source clock prescaler */
#define RCU_PLLPSC_DIV_MIN              ((uint32_t)2U)                     /*!< PLLPSC_DIV min value */
#define RCU_PLLPSC_DIV_MAX              ((uint32_t)63U)                    /*!< PLLPSC_DIV max value */

/* The PLL VCO clock multi factor */
#define RCU_PLLN_MUL_MIN                ((uint32_t)64U)                    /*!< PLLN_MUL min value */
#define RCU_PLLN_MUL_MAX                ((uint32_t)511U)                   /*!< PLLN_MUL max value */
#define RCU_SS_MODULATION_CENTER_INC    ((uint32_t)7U)                     /*!< minimum factor of PLLN in center mode */
#define RCU_SS_MODULATION_DOWN_INC      ((uint32_t)11U)                    /*!< minimum factor of PLLN in down mode */

/* The PLLP output frequency division factor from PLL VCO clock */
#define RCU_PLLP_DIV_MIN                ((uint32_t)2U)                     /*!< PLLP_DIV min value */
#define RCU_PLLP_DIV_MAX                ((uint32_t)8U)                     /*!< PLLP_DIV max value */
                                         
/* PLL Clock Source Selection  */
#define RCU_PLLSRC_IRC16M               ((uint32_t)0x00000000U)            /*!< IRC16M clock selected as source clock of PLL, PLLDIG, PLLI2S */
#define RCU_PLLSRC_HXTAL                RCU_PLL_PLLSEL                     /*!< HXTAL clock selected as source clock of PLL, PLLDIG, PLLI2S */


#define CHECK_PLL_PSC_VALID(val)        (((val) >= RCU_PLLPSC_DIV_MIN)&&((val) <= RCU_PLLPSC_DIV_MAX))
#define CHECK_PLL_N_VALID(val, inc)     (((val) >= (RCU_PLLN_MUL_MIN + (inc)))&&((val) <= RCU_PLLN_MUL_MAX))
#define CHECK_PLL_P_VALID(val)          (((val) == 2U) || ((val) == 4U) || ((val) == 6U) || ((val) == 8U))

/* RCU_BDCTL register bit define */
/* LXTAL drive capability */
#define BDCTL_LXTALDRI(regval)         (BITS(3,4) & ((uint32_t)(regval) << 3U))
#define RCU_LXTALDRI_LOWER_DRIVE        ((uint32_t)0x00000000)             /*!< LXTAL drive capability is selected lower */
#define RCU_LXTALDRI_HIGH_DRIVE         BDCTL_LXTALDRI(1)                  /*!< LXTAL drive capability is selected high */
#define RCU_LXTALDRI_HIGHER_DRIVE       BDCTL_LXTALDRI(2)                  /*!< LXTAL drive capability is selected higher */
#define RCU_LXTALDRI_HIGHEST_DRIVE      BDCTL_LXTALDRI(3)                  /*!< LXTAL drive capability is selected highest */

/* RTC clock entry selection */
#define BDCTL_RTCSRC(regval)            (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_RTCSRC_NONE                 BDCTL_RTCSRC(0)                    /*!< no clock selected */
#define RCU_RTCSRC_LXTAL                BDCTL_RTCSRC(1)                    /*!< RTC source clock select LXTAL  */
#define RCU_RTCSRC_IRC32K               BDCTL_RTCSRC(2)                    /*!< RTC source clock select IRC32K */
#define RCU_RTCSRC_HXTAL_DIV_RTCDIV     BDCTL_RTCSRC(3)                    /*!< RTC source clock select HXTAL/RTCDIV */

/* RCU_PLLCFG register bit define */
/* the divider factor from PLLI2S clock */
#define PLLCFG_PLLI2SDIV(regval)        (BITS(0,5) & ((uint32_t)(regval) << 0U))
#define RCU_PLLI2S_DIV32                PLLCFG_PLLI2SDIV(0)                         /*!< CK_PLLI2SDIV clock select CK_PLLI2S/32 */
#define RCU_PLLI2S_NONE_1               PLLCFG_PLLI2SDIV(1)                         /*!< reserved */
#define RCU_PLLI2S_NONE_2               PLLCFG_PLLI2SDIV(2)                         /*!< reserved */
#define RCU_PLLI2S_DIV1_5               PLLCFG_PLLI2SDIV(3)                         /*!< CK_PLLI2SDIV clock select CK_PLLI2S/1.5 */
#define RCU_PLLI2S_DIV2                 PLLCFG_PLLI2SDIV(4)                         /*!< CK_PLLI2SDIV clock select CK_PLLI2S/2 */
#define RCU_PLLI2S_DIV2_5               PLLCFG_PLLI2SDIV(5)                         /*!< CK_PLLI2SDIV clock select CK_PLLI2S/2.5 */
#define RCU_PLLI2S_DIV3                 PLLCFG_PLLI2SDIV(6)                         /*!< CK_PLLI2SDIV clock select CK_PLLI2S/3 */
#define RCU_PLLI2S_DIV3_5               PLLCFG_PLLI2SDIV(7)                         /*!< CK_PLLI2SDIV clock select CK_PLLI2S/3.5 */
#define RCU_PLLI2S_DIV4                 PLLCFG_PLLI2SDIV(8)                         /*!< CK_PLLI2SDIV clock select CK_PLLI2S/4 */
#define RCU_PLLI2S_DIV4_5               PLLCFG_PLLI2SDIV(9)                         /*!< CK_PLLI2SDIV clock select CK_PLLI2S/4.5 */
#define RCU_PLLI2S_DIV5                 PLLCFG_PLLI2SDIV(10)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/5 */
#define RCU_PLLI2S_DIV5_5               PLLCFG_PLLI2SDIV(11)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/5.5 */
#define RCU_PLLI2S_DIV6                 PLLCFG_PLLI2SDIV(12)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/6 */
#define RCU_PLLI2S_DIV6_5               PLLCFG_PLLI2SDIV(13)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/6.5 */
#define RCU_PLLI2S_DIV7                 PLLCFG_PLLI2SDIV(14)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/7 */
#define RCU_PLLI2S_DIV7_5               PLLCFG_PLLI2SDIV(15)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/7.5 */
#define RCU_PLLI2S_DIV8                 PLLCFG_PLLI2SDIV(16)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/8 */
#define RCU_PLLI2S_DIV8_5               PLLCFG_PLLI2SDIV(17)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/8.5 */
#define RCU_PLLI2S_DIV9                 PLLCFG_PLLI2SDIV(18)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/9 */
#define RCU_PLLI2S_DIV9_5               PLLCFG_PLLI2SDIV(19)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/9.5 */
#define RCU_PLLI2S_DIV10                PLLCFG_PLLI2SDIV(20)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/10 */
#define RCU_PLLI2S_DIV10_5              PLLCFG_PLLI2SDIV(21)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/10.5 */
#define RCU_PLLI2S_DIV11                PLLCFG_PLLI2SDIV(22)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/11 */
#define RCU_PLLI2S_DIV11_5              PLLCFG_PLLI2SDIV(23)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/11.5 */
#define RCU_PLLI2S_DIV12                PLLCFG_PLLI2SDIV(24)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/12 */
#define RCU_PLLI2S_DIV12_5              PLLCFG_PLLI2SDIV(25)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/12.5 */
#define RCU_PLLI2S_DIV13                PLLCFG_PLLI2SDIV(26)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/13 */
#define RCU_PLLI2S_DIV13_5              PLLCFG_PLLI2SDIV(27)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/13.5 */
#define RCU_PLLI2S_DIV14                PLLCFG_PLLI2SDIV(28)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/14 */
#define RCU_PLLI2S_DIV14_5              PLLCFG_PLLI2SDIV(29)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/14.5 */
#define RCU_PLLI2S_DIV15                PLLCFG_PLLI2SDIV(30)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/15 */
#define RCU_PLLI2S_DIV15_5              PLLCFG_PLLI2SDIV(31)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/15.5 */
#define RCU_PLLI2S_DIV16                PLLCFG_PLLI2SDIV(32)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/16 */
#define RCU_PLLI2S_DIV16_5              PLLCFG_PLLI2SDIV(33)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/16.5 */
#define RCU_PLLI2S_DIV17                PLLCFG_PLLI2SDIV(34)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/17 */
#define RCU_PLLI2S_DIV17_5              PLLCFG_PLLI2SDIV(35)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/17.5 */
#define RCU_PLLI2S_DIV18                PLLCFG_PLLI2SDIV(36)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/18 */
#define RCU_PLLI2S_DIV18_5              PLLCFG_PLLI2SDIV(37)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/18.5 */
#define RCU_PLLI2S_DIV19                PLLCFG_PLLI2SDIV(38)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/19 */
#define RCU_PLLI2S_DIV19_5              PLLCFG_PLLI2SDIV(39)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/19.5 */
#define RCU_PLLI2S_DIV20                PLLCFG_PLLI2SDIV(40)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/20 */
#define RCU_PLLI2S_DIV20_5              PLLCFG_PLLI2SDIV(41)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/20.5 */
#define RCU_PLLI2S_DIV21                PLLCFG_PLLI2SDIV(42)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/21 */
#define RCU_PLLI2S_DIV21_5              PLLCFG_PLLI2SDIV(43)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/21.5 */
#define RCU_PLLI2S_DIV22                PLLCFG_PLLI2SDIV(44)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/22 */
#define RCU_PLLI2S_DIV22_5              PLLCFG_PLLI2SDIV(45)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/22.5 */
#define RCU_PLLI2S_DIV23                PLLCFG_PLLI2SDIV(46)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/23 */
#define RCU_PLLI2S_DIV23_5              PLLCFG_PLLI2SDIV(47)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/23.5 */
#define RCU_PLLI2S_DIV24                PLLCFG_PLLI2SDIV(48)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/24 */
#define RCU_PLLI2S_DIV24_5              PLLCFG_PLLI2SDIV(49)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/24.5 */
#define RCU_PLLI2S_DIV25                PLLCFG_PLLI2SDIV(50)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/25 */
#define RCU_PLLI2S_DIV25_5              PLLCFG_PLLI2SDIV(51)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/25.5 */
#define RCU_PLLI2S_DIV26                PLLCFG_PLLI2SDIV(52)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/26 */
#define RCU_PLLI2S_DIV26_5              PLLCFG_PLLI2SDIV(53)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/26.5 */
#define RCU_PLLI2S_DIV27                PLLCFG_PLLI2SDIV(54)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/27 */
#define RCU_PLLI2S_DIV27_5              PLLCFG_PLLI2SDIV(55)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/27.5 */
#define RCU_PLLI2S_DIV28                PLLCFG_PLLI2SDIV(56)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/28 */
#define RCU_PLLI2S_DIV28_5              PLLCFG_PLLI2SDIV(57)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/28.5 */
#define RCU_PLLI2S_DIV29                PLLCFG_PLLI2SDIV(58)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/29 */
#define RCU_PLLI2S_DIV29_5              PLLCFG_PLLI2SDIV(59)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/29.5 */
#define RCU_PLLI2S_DIV30                PLLCFG_PLLI2SDIV(60)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/30 */
#define RCU_PLLI2S_DIV30_5              PLLCFG_PLLI2SDIV(61)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/30.5 */
#define RCU_PLLI2S_DIV31                PLLCFG_PLLI2SDIV(62)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/31 */
#define RCU_PLLI2S_DIV31_5              PLLCFG_PLLI2SDIV(63)                        /*!< CK_PLLI2SDIV clock select CK_PLLI2S/31.5 */

/* RCU_PLLI2S register bit define */
/* The PLLI2S VCO clock multi factor */
#define RCU_PLLI2SN_MUL_MIN             8U
#define RCU_PLLI2SN_MUL_MAX             127U

#define CHECK_PLLI2S_N_VALID(val)       (((val) >= RCU_PLLI2SN_MUL_MIN)&&((val) <= RCU_PLLI2SN_MUL_MAX))

