CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_rcu.h
/* PLLI2S VCO source clock pre-scale */
#define PLLCFG_PLLI2SPSC(regval)         (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define RCU_PLLI2SSRC_DIV1                PLLCFG_PLLI2SPSC(0)                       /*!< PLLI2S vco input source clock divided by 1 */
#define RCU_PLLI2SSRC_DIV2                PLLCFG_PLLI2SPSC(1)                       /*!< PLLI2S vco input source clock divided by 2 */
#define RCU_PLLI2SSRC_DIV3                PLLCFG_PLLI2SPSC(2)                       /*!< PLLI2S vco input source clock divided by 3 */
#define RCU_PLLI2SSRC_DIV4                PLLCFG_PLLI2SPSC(3)                       /*!< PLLI2S vco input source clock divided by 4 */
#define RCU_PLLI2SSRC_DIV5                PLLCFG_PLLI2SPSC(4)                       /*!< PLLI2S vco input source clock divided by 5 */
#define RCU_PLLI2SSRC_DIV6                PLLCFG_PLLI2SPSC(5)                       /*!< PLLI2S vco input source clock divided by 6 */
#define RCU_PLLI2SSRC_DIV7                PLLCFG_PLLI2SPSC(6)                       /*!< PLLI2S vco input source clock divided by 7 */
#define RCU_PLLI2SSRC_DIV8                PLLCFG_PLLI2SPSC(7)                       /*!< PLLI2S vco input source clock divided by 8 */

/* PLLDIG Clock Selection  */
#define PLLDIG_OUTPUTSEL(regval)         (BITS(24,25) & ((uint32_t)(regval) << 24U))
#define RCU_PLLDIG_192M                   PLLDIG_OUTPUTSEL(0)                       /*!< selected 192Mhz as PLLDIG output frequency */
#define RCU_PLLDIG_240M                   PLLDIG_OUTPUTSEL(1)                       /*!< selected 240Mhz as PLLDIG output frequency */
#define RCU_PLLDIG_320M                   PLLDIG_OUTPUTSEL(2)                       /*!< selected 320Mhz as PLLDIG output frequency */
#define RCU_PLLDIG_480M                   PLLDIG_OUTPUTSEL(3)                       /*!< selected 480Mhz as PLLDIG output frequency */

/* PLLDIG clock divider factor for system clock */
#define PLLCFG_PLLDIGFSYSDIV(regval)         (BITS(26,31) & ((uint32_t)(regval) << 26U))
#define RCU_PLLDIGFSYS_DIV1               PLLCFG_PLLDIGFSYSDIV(0)                   /*!< PLLDIG clock divided by 1 for system clock */
#define RCU_PLLDIGFSYS_DIV2               PLLCFG_PLLDIGFSYSDIV(1)                   /*!< PLLDIG clock divided by 2 for system clock */
#define RCU_PLLDIGFSYS_DIV3               PLLCFG_PLLDIGFSYSDIV(2)                   /*!< PLLDIG clock divided by 3 for system clock */
#define RCU_PLLDIGFSYS_DIV4               PLLCFG_PLLDIGFSYSDIV(3)                   /*!< PLLDIG clock divided by 4 for system clock */
#define RCU_PLLDIGFSYS_DIV5               PLLCFG_PLLDIGFSYSDIV(4)                   /*!< PLLDIG clock divided by 5 for system clock */
#define RCU_PLLDIGFSYS_DIV6               PLLCFG_PLLDIGFSYSDIV(5)                   /*!< PLLDIG clock divided by 6 for system clock */
#define RCU_PLLDIGFSYS_DIV7               PLLCFG_PLLDIGFSYSDIV(6)                   /*!< PLLDIG clock divided by 7 for system clock */
#define RCU_PLLDIGFSYS_DIV8               PLLCFG_PLLDIGFSYSDIV(7)                   /*!< PLLDIG clock divided by 8 for system clock */
#define RCU_PLLDIGFSYS_DIV9               PLLCFG_PLLDIGFSYSDIV(8)                   /*!< PLLDIG clock divided by 9 for system clock */
#define RCU_PLLDIGFSYS_DIV10              PLLCFG_PLLDIGFSYSDIV(9)                   /*!< PLLDIG clock divided by 10 for system clock */
#define RCU_PLLDIGFSYS_DIV11              PLLCFG_PLLDIGFSYSDIV(10)                  /*!< PLLDIG clock divided by 11 for system clock */
#define RCU_PLLDIGFSYS_DIV12              PLLCFG_PLLDIGFSYSDIV(11)                  /*!< PLLDIG clock divided by 12 for system clock */
#define RCU_PLLDIGFSYS_DIV13              PLLCFG_PLLDIGFSYSDIV(12)                  /*!< PLLDIG clock divided by 13 for system clock */
#define RCU_PLLDIGFSYS_DIV14              PLLCFG_PLLDIGFSYSDIV(13)                  /*!< PLLDIG clock divided by 14 for system clock */
#define RCU_PLLDIGFSYS_DIV15              PLLCFG_PLLDIGFSYSDIV(14)                  /*!< PLLDIG clock divided by 15 for system clock */
#define RCU_PLLDIGFSYS_DIV16              PLLCFG_PLLDIGFSYSDIV(15)                  /*!< PLLDIG clock divided by 16 for system clock */
#define RCU_PLLDIGFSYS_DIV17              PLLCFG_PLLDIGFSYSDIV(16)                  /*!< PLLDIG clock divided by 17 for system clock */
#define RCU_PLLDIGFSYS_DIV18              PLLCFG_PLLDIGFSYSDIV(17)                  /*!< PLLDIG clock divided by 18 for system clock */
#define RCU_PLLDIGFSYS_DIV19              PLLCFG_PLLDIGFSYSDIV(18)                  /*!< PLLDIG clock divided by 19 for system clock */
#define RCU_PLLDIGFSYS_DIV20              PLLCFG_PLLDIGFSYSDIV(19)                  /*!< PLLDIG clock divided by 20 for system clock */
#define RCU_PLLDIGFSYS_DIV21              PLLCFG_PLLDIGFSYSDIV(20)                  /*!< PLLDIG clock divided by 21 for system clock */
#define RCU_PLLDIGFSYS_DIV22              PLLCFG_PLLDIGFSYSDIV(21)                  /*!< PLLDIG clock divided by 22 for system clock */
#define RCU_PLLDIGFSYS_DIV23              PLLCFG_PLLDIGFSYSDIV(22)                  /*!< PLLDIG clock divided by 23 for system clock */
#define RCU_PLLDIGFSYS_DIV24              PLLCFG_PLLDIGFSYSDIV(23)                  /*!< PLLDIG clock divided by 24 for system clock */
#define RCU_PLLDIGFSYS_DIV25              PLLCFG_PLLDIGFSYSDIV(24)                  /*!< PLLDIG clock divided by 25 for system clock */
#define RCU_PLLDIGFSYS_DIV26              PLLCFG_PLLDIGFSYSDIV(25)                  /*!< PLLDIG clock divided by 26 for system clock */
#define RCU_PLLDIGFSYS_DIV27              PLLCFG_PLLDIGFSYSDIV(26)                  /*!< PLLDIG clock divided by 27 for system clock */
#define RCU_PLLDIGFSYS_DIV28              PLLCFG_PLLDIGFSYSDIV(27)                  /*!< PLLDIG clock divided by 28 for system clock */
#define RCU_PLLDIGFSYS_DIV29              PLLCFG_PLLDIGFSYSDIV(28)                  /*!< PLLDIG clock divided by 29 for system clock */
#define RCU_PLLDIGFSYS_DIV30              PLLCFG_PLLDIGFSYSDIV(29)                  /*!< PLLDIG clock divided by 30 for system clock */
#define RCU_PLLDIGFSYS_DIV31              PLLCFG_PLLDIGFSYSDIV(30)                  /*!< PLLDIG clock divided by 31 for system clock */
#define RCU_PLLDIGFSYS_DIV32              PLLCFG_PLLDIGFSYSDIV(31)                  /*!< PLLDIG clock divided by 32 for system clock */
#define RCU_PLLDIGFSYS_DIV33              PLLCFG_PLLDIGFSYSDIV(32)                  /*!< PLLDIG clock divided by 33 for system clock */
#define RCU_PLLDIGFSYS_DIV34              PLLCFG_PLLDIGFSYSDIV(33)                  /*!< PLLDIG clock divided by 34 for system clock */
#define RCU_PLLDIGFSYS_DIV35              PLLCFG_PLLDIGFSYSDIV(34)                  /*!< PLLDIG clock divided by 35 for system clock */
#define RCU_PLLDIGFSYS_DIV36              PLLCFG_PLLDIGFSYSDIV(35)                  /*!< PLLDIG clock divided by 36 for system clock */
#define RCU_PLLDIGFSYS_DIV37              PLLCFG_PLLDIGFSYSDIV(36)                  /*!< PLLDIG clock divided by 37 for system clock */
#define RCU_PLLDIGFSYS_DIV38              PLLCFG_PLLDIGFSYSDIV(37)                  /*!< PLLDIG clock divided by 38 for system clock */
#define RCU_PLLDIGFSYS_DIV39              PLLCFG_PLLDIGFSYSDIV(38)                  /*!< PLLDIG clock divided by 39 for system clock */
#define RCU_PLLDIGFSYS_DIV40              PLLCFG_PLLDIGFSYSDIV(39)                  /*!< PLLDIG clock divided by 40 for system clock */
#define RCU_PLLDIGFSYS_DIV41              PLLCFG_PLLDIGFSYSDIV(40)                  /*!< PLLDIG clock divided by 41 for system clock */
#define RCU_PLLDIGFSYS_DIV42              PLLCFG_PLLDIGFSYSDIV(41)                  /*!< PLLDIG clock divided by 42 for system clock */
#define RCU_PLLDIGFSYS_DIV43              PLLCFG_PLLDIGFSYSDIV(42)                  /*!< PLLDIG clock divided by 43 for system clock */
#define RCU_PLLDIGFSYS_DIV44              PLLCFG_PLLDIGFSYSDIV(43)                  /*!< PLLDIG clock divided by 44 for system clock */
#define RCU_PLLDIGFSYS_DIV45              PLLCFG_PLLDIGFSYSDIV(44)                  /*!< PLLDIG clock divided by 45 for system clock */
#define RCU_PLLDIGFSYS_DIV46              PLLCFG_PLLDIGFSYSDIV(45)                  /*!< PLLDIG clock divided by 46 for system clock */
#define RCU_PLLDIGFSYS_DIV47              PLLCFG_PLLDIGFSYSDIV(46)                  /*!< PLLDIG clock divided by 47 for system clock */
#define RCU_PLLDIGFSYS_DIV48              PLLCFG_PLLDIGFSYSDIV(47)                  /*!< PLLDIG clock divided by 48 for system clock */
#define RCU_PLLDIGFSYS_DIV49              PLLCFG_PLLDIGFSYSDIV(48)                  /*!< PLLDIG clock divided by 49 for system clock */
#define RCU_PLLDIGFSYS_DIV50              PLLCFG_PLLDIGFSYSDIV(49)                  /*!< PLLDIG clock divided by 50 for system clock */
#define RCU_PLLDIGFSYS_DIV51              PLLCFG_PLLDIGFSYSDIV(50)                  /*!< PLLDIG clock divided by 51 for system clock */
#define RCU_PLLDIGFSYS_DIV52              PLLCFG_PLLDIGFSYSDIV(51)                  /*!< PLLDIG clock divided by 52 for system clock */
#define RCU_PLLDIGFSYS_DIV53              PLLCFG_PLLDIGFSYSDIV(52)                  /*!< PLLDIG clock divided by 53 for system clock */
#define RCU_PLLDIGFSYS_DIV54              PLLCFG_PLLDIGFSYSDIV(53)                  /*!< PLLDIG clock divided by 54 for system clock */
#define RCU_PLLDIGFSYS_DIV55              PLLCFG_PLLDIGFSYSDIV(54)                  /*!< PLLDIG clock divided by 55 for system clock */
#define RCU_PLLDIGFSYS_DIV56              PLLCFG_PLLDIGFSYSDIV(55)                  /*!< PLLDIG clock divided by 56 for system clock */
#define RCU_PLLDIGFSYS_DIV57              PLLCFG_PLLDIGFSYSDIV(56)                  /*!< PLLDIG clock divided by 57 for system clock */
#define RCU_PLLDIGFSYS_DIV58              PLLCFG_PLLDIGFSYSDIV(57)                  /*!< PLLDIG clock divided by 58 for system clock */
#define RCU_PLLDIGFSYS_DIV59              PLLCFG_PLLDIGFSYSDIV(58)                  /*!< PLLDIG clock divided by 59 for system clock */
#define RCU_PLLDIGFSYS_DIV60              PLLCFG_PLLDIGFSYSDIV(59)                  /*!< PLLDIG clock divided by 60 for system clock */
#define RCU_PLLDIGFSYS_DIV61              PLLCFG_PLLDIGFSYSDIV(60)                  /*!< PLLDIG clock divided by 61 for system clock */
#define RCU_PLLDIGFSYS_DIV62              PLLCFG_PLLDIGFSYSDIV(61)                  /*!< PLLDIG clock divided by 62 for system clock */
#define RCU_PLLDIGFSYS_DIV63              PLLCFG_PLLDIGFSYSDIV(62)                  /*!< PLLDIG clock divided by 63 for system clock */
#define RCU_PLLDIGFSYS_DIV64              PLLCFG_PLLDIGFSYSDIV(63)                  /*!< PLLDIG clock divided by 64 for system clock */

/* PLLDIG Clock Selection  */
#define PLLDIG_OUTPUTSEL(regval)         (BITS(24,25) & ((uint32_t)(regval) << 24U))
#define RCU_PLLDIG_192M                   PLLDIG_OUTPUTSEL(0)                       /*!< selected 192Mhz as PLLDIG output frequency */
#define RCU_PLLDIG_240M                   PLLDIG_OUTPUTSEL(1)                       /*!< selected 240Mhz as PLLDIG output frequency */
#define RCU_PLLDIG_320M                   PLLDIG_OUTPUTSEL(2)                       /*!< selected 320Mhz as PLLDIG output frequency */
#define RCU_PLLDIG_480M                   PLLDIG_OUTPUTSEL(3)                       /*!< selected 480Mhz as PLLDIG output frequency */

